Extensions/АБ/Documents/ИсходящееПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИсходящееПисьмо</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ДокументОснованиеКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/АБ/Enums/ТипыАдресатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыАдресатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Кому</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Копия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкрытаяКопия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Catalogs/ДокументыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ВидАгентскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДСОпределяетсяВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПроцентНеустойки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ВариантДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ВариантыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипНеустойки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыНеустойки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВременныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьНежилогоПомещения</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЭтажЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерУчастка</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АдресОбъекта</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПередаваемоеОборудование</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснованиеПраваСобственности</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПередачиОбъектаАрендодателем</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПринятияОбъектаАрендатором</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НДСВСоставеАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АренднаяПлатаЗаПользованиеОборудованием</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснащениеИмущества</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ДополнительноПереданныеДокументыИПредметы</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПоказанияПриборовУчётаНаМоментПередачи</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стороны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаименованияСторон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписал</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сторона</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Основание</Name>
							<Comment>//Миляев 293293</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.АБ_ОтветственныеЛицаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Почта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Установил</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Documents/ИсходящееПисьмо/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&После("ПриСозданииНаСервере")
Процедура АБ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++dar 25.02.26 (309302)
	УВМ_РаботаСФормами.СоздатьРеквизит(ЭтотОбъект, "УВМ_ТекстПисьма", УВМ_РаботаСФормами.ОписаниеТипаСтрока());
	//--dar 25.02.26 (309302)                             
	
	//++dar 02.06.26 (330921)
	Если Объект.Ссылка.Пустая()
		И Параметры.Свойство("УВМ_ДокументКонтрагента")
		И ЗначениеЗаполнено(Параметры.УВМ_ДокументКонтрагента) Тогда
		
		УВМ_ЗаполнитьПисьмоПоДоговоруКонтрагента(Параметры.УВМ_ДокументКонтрагента);
	КонецЕсли;
	//--dar 02.06.26 (330921)
	
КонецПроцедуры            

//++dar 02.06.26 (330921)
&НаСервере
Процедура УВМ_ЗаполнитьПисьмоПоДоговоруКонтрагента(ДоговорКонтрагента)

	// 1. Связь письма с договором
	Объект.УВМ_ДокументОснованиеКонтрагент = ДоговорКонтрагента;

	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорКонтрагента,
		"РегистрационныйНомер, ДатаРегистрации, ВременныйНомер, ДатаНачалаДействия");

	// 2. Тема письма формата: «Договор № [Номер] от [Дата]»
	НомерДоговора = ?(ЗначениеЗаполнено(РеквизитыДоговора.РегистрационныйНомер),
		РеквизитыДоговора.РегистрационныйНомер, РеквизитыДоговора.ВременныйНомер);
	ДатаДоговора = ?(ЗначениеЗаполнено(РеквизитыДоговора.ДатаРегистрации),
		РеквизитыДоговора.ДатаРегистрации, РеквизитыДоговора.ДатаНачалаДействия);

	Объект.Тема = СтрШаблон("Договор № %1 от %2",
		НомерДоговора, Формат(ДатаДоговора, "ДЛФ=D"));

	// 3. Кому (Адресат): почтовые адреса контрагента из ТЧ «Стороны»
	Получатели.Очистить();
	Если Параметры.Свойство("УВМ_ПолучателиПисьма") Тогда
		МассивПочт = Параметры.УВМ_ПолучателиПисьма;
	Иначе
		МассивПочт = УВМ_ПочтыКонтрагентаПоДоговору(ДоговорКонтрагента);
	КонецЕсли;

	Для Каждого АдресПочты Из МассивПочт Цикл
		Если Не ЗначениеЗаполнено(АдресПочты) Тогда
			Продолжить;
		КонецЕсли;
		НовыйПолучатель = Получатели.Добавить();
		НовыйПолучатель.ТипАдреса      = Перечисления.ТипыАдресатов.Кому;
		НовыйПолучатель.Представление  = АдресПочты;
		НовыйПолучатель.Адрес          = АдресПочты;
		НовыйПолучатель.Внешний        = Истина;
		НовыйПолучатель.ВидМаршрутизации = Перечисления.ВидыМаршрутизацииПисем.Внешняя;
	КонецЦикла;

	// 4. Вложения: оставляем только PDF договора (он уже прикреплён к договору
	//    процедурой УВМ_ПрикрепитьФайлPDF до открытия формы и подтянут по основанию)
	МассивНаУдаление = Новый Массив;
	Для Каждого ТекВложение Из Вложения Цикл
		Если ВРег(Прав(ТекВложение.Представление, 4)) <> ".PDF" Тогда
			МассивНаУдаление.Добавить(ТекВложение);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекВложение Из МассивНаУдаление Цикл
		Вложения.Удалить(ТекВложение);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция УВМ_ПочтыКонтрагентаПоДоговору(ДоговорКонтрагента)

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", ДоговорКонтрагента);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Стороны.УВМ_Почта КАК УВМ_Почта
	|ИЗ
	|	Справочник.ДокументыПредприятия.Стороны КАК Стороны
	|ГДЕ
	|	Стороны.Ссылка = &Договор
	|	И Стороны.Сторона ССЫЛКА Справочник.Контрагенты";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Для Каждого АдресПочты Из СтрРазделить(СтрЗаменить(Выборка.УВМ_Почта, " ", ""), ",", Ложь) Цикл
			Если ЗначениеЗаполнено(АдресПочты) И Результат.Найти(АдресПочты) = Неопределено Тогда
				Результат.Добавить(АдресПочты);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Результат;

КонецФункции
//--dar 02.06.26 (330921)

&НаКлиенте
&ИзменениеИКонтроль("ВыполнитьЗаписьHTML")
Процедура АБ_ВыполнитьЗаписьHTML()

	Если ВыполняетсяЗапись Тогда

		ТекстПисьмаHTMLПриЗаписи = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLПриЗаписи);
		ТекстПисьмаHTMLДляОтменыОтправки = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLДляОтменыОтправки);
		ТекстПисьмаПоследнегоАвтосохранения = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПоследнегоАвтосохранения);
		ТекстПисьмаПриОткрытии  = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПриОткрытии);

		Возврат;
	КонецЕсли;	

	HTMLДокумент = Элементы.ТекстПисьмаHTML.Документ; 

	ЗапомнитьПозициюHTML();

	ТекстПисьмаHTMLДляОтменыОтправки = "<html><body>" + HTMLДокумент.body.innerHTML + "</body></html>";

	Если ФайловыеФункцииСлужебныйКлиент.РасширениеРаботыСФайламиПодключено() Тогда

		// в веб клиенте  HTMLДокумент.images недоступен
		#Если Не ВебКлиент Тогда 

			ЧислоКартинок = HTMLДокумент.images.length;  
			Для Индекс = 0 По ЧислоКартинок - 1 Цикл  

				Изображение = HTMLДокумент.images.item(Индекс);		

				Попытка
					Если Найти(ВРег(Изображение.src), ВРег("file://")) = 1 Тогда

						ПутьФайла = Сред(Изображение.src, СтрДлина("file://") + 1);
						ПутьФайла = СтрЗаменить(ПутьФайла, "%20", " ");

						ПервыйСимвол = Лев(ПутьФайла, 1);
						ВторойСимвол = Сред(ПутьФайла, 2, 1);
						Если ПервыйСимвол = "/" Или ПервыйСимвол = "\" Тогда

							Если ВторойСимвол <> "/" И ВторойСимвол <> "\" Тогда
								ПутьФайла = Сред(ПутьФайла, 2);
							КонецЕсли;	

						КонецЕсли;	

						АдресВоВременномХранилище = "";

						ПомещаемыеФайлы = Новый Массив;
						Описание = Новый ОписаниеПередаваемогоФайла(ПутьФайла, "");
						ПомещаемыеФайлы.Добавить(Описание);
						ПомещенныеФайлы = Новый Массив;
						Если Не ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,, Ложь, УникальныйИдентификатор) Тогда
							ВызватьИсключение
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось поместить файл: ""%1"" в хранилище'"),
							ПутьФайла);
						КонецЕсли;

						Если ПомещенныеФайлы.Количество() = 1 Тогда
							АдресВоВременномХранилище = ПомещенныеФайлы[0].Хранение;
						Иначе
							ВызватьИсключение
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не удалось поместить файл: ""%1"" в хранилище'"),
							ПутьФайла);
						КонецЕсли;

						УникальныйИдентификаторФайла = Новый УникальныйИдентификатор; 
						УникальныйИдентификаторФайла = Строка(УникальныйИдентификаторФайла);
						Изображение.src = "cid:" + УникальныйИдентификаторФайла;

						Файл = Новый Файл(ПутьФайла);

						ОписаниеФайла = Новый Структура("Адрес, УникальныйИдентификаторФайла, ВремяИзменения, ИмяФайла, Размер, Ссылка",
						АдресВоВременномХранилище, УникальныйИдентификаторФайла,
						Файл.ПолучитьВремяИзменения(), Файл.Имя, Файл.Размер(), 
						Неопределено);

						СписокДобавленныхФайлов.Добавить(ОписаниеФайла);

					КонецЕсли;	
				Исключение
					СообщениеОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Почта.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке);
				КонецПопытки;

			КонецЦикла;	

		#КонецЕсли

	КонецЕсли;

	ТекстВПоле = HTMLДокумент.body.innerHTML;
	#Вставка
	Если НЕ ЗначениеЗаполнено(ТекстВПоле) И ЗначениеЗаполнено(ЭтотОбъект.УВМ_ТекстПисьма) Тогда
		//++dar 25.02.26 (309302)
		ТекстВПоле = ЭтотОбъект.УВМ_ТекстПисьма;
		//--dar 25.02.26 (309302)
	КонецЕсли;
	#КонецВставки
	ТекстПисьмаHTMLПриЗаписи = "<html><body>" + ТекстВПоле + "</body></html>";

	ТекстПисьмаHTMLПриЗаписи = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLПриЗаписи);
	ТекстПисьмаHTMLДляОтменыОтправки = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаHTMLДляОтменыОтправки);
	ТекстПисьмаПоследнегоАвтосохранения = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПоследнегоАвтосохранения);
	ТекстПисьмаПриОткрытии  = ОбработкаСтрокиXML.УдалитьНедопустимыеСимволыXML(ТекстПисьмаПриОткрытии);

КонецПроцедуры
